lvshijie2016/jy-zb-mcu/MM32F0xx_library/MM32F031x8/Include/MM32F031x8.h
/*******************  Bit definition for SPI_INTEN register  ********************/
#define  SPI_INTEN_TX_IEN                   ((uint16_t)0x0001)  		   /*!<  Transmitter empty interrupt flag bit*/  
#define  SPI_INTEN_RX_IEN                   ((uint16_t)0x0002)  		   /*!<  Receive FIFO interrupt enable bit*/  
#define  SPI_INTEN_UNDERRUN_IEN             ((uint16_t)0x0004)  		   /*!<  Transmitter underrun interrupt enable bit（SPI slave mode only）*/  
#define  SPI_INTEN_RXOERR_IEN               ((uint16_t)0x0008)  		   /*!<  Overrun error interrupt enable bit*/ 
#define  SPI_INTEN_RXMATCH_IEN              ((uint16_t)0x0010)  		   /*!<  Receive data complete interrupt enable bit*/ 
#define  SPI_INTEN_RXFULL_IEN               ((uint16_t)0x0020)   		   /*!<  Receive FIFO full interrupt enable bit*/
#define  SPI_INTEN_TXEPT_IEN                ((uint16_t)0x0040)   		   /*!<  Transmit empty interrupt enable bit*/  

/*******************  Bit definition for SPI_INTCLR register  ********************/
#define  SPI_INTCLR_TX_ICLR                 ((uint16_t)0x0001)    		   /*!<  Transmitter FIFO empty interrupt clear bit*/
#define  SPI_INTCLR_RX_ICLR                 ((uint16_t)0x0002)      	   /*!<  Receive interrupt clear bit*/
#define  SPI_INTCLR_UNDERRUN_ICLR           ((uint16_t)0x0004)         	   /*!<  Transmitter underrun interrupt clear bit（SPI slave mode only）*/
#define  SPI_INTCLR_RXOERR_ICLR             ((uint16_t)0x0008)  		   /*!<  Overrun error interrupt clear bit*/  
#define  SPI_INTCLR_RXMATCH_ICLR            ((uint16_t)0x0010)  		   /*!<  Receive completed interrupt clear bit*/  
#define  SPI_INTCLR_RXFULL_ICLR             ((uint16_t)0x0020)  		   /*!<  Receiver buffer full interrupt clear bit*/  
#define  SPI_INTCLR_TXEPT_ICLR              ((uint16_t)0x0040)  		   /*!<  Transmitter empty interrupt clear bit*/

/*******************  Bit definition for SPI_GCTL register  ********************/  
#define  SPI_GCTL_SPIEN                     ((uint16_t)0x0001)  		   /*!<  SPI select bit*/  
#define  SPI_GCTL_INT_EN                    ((uint16_t)0x0002)  		   /*!<  SPI interrupt enable bit*/  
#define  SPI_GCTL_MM                        ((uint16_t)0x0004)  		   /*!<  Master mode bit*/
#define  SPI_GCTL_TXEN                      ((uint16_t)0x0008)  		   /*!<  Transmit enable bit*/ 
#define  SPI_GCTL_RXEN                      ((uint16_t)0x0010)  		   /*!<  Receive enable bit*/

#define  SPI_GCTL_RXTLF                     ((uint16_t)0x0060)  		   /*!<  RX FIFO trigger level bit*/ 
#define  SPI_GCTL_RXTLF_0                   ((uint16_t)0x0020)            /*!<   Bit 0 */
#define  SPI_GCTL_RXTLF_1                   ((uint16_t)0x0040)            /*!<   Bit 1 */

#define  SPI_GCTL_TXTLF                     ((uint16_t)0x0180)  		   /*!<  TX FIFO trigger level bit*/ 			  
#define  SPI_GCTL_TXTLF_0                   ((uint16_t)0x0080) 			  /*!<   Bit 0 */
#define  SPI_GCTL_TXTLF_1                   ((uint16_t)0x0100) 			  /*!<   Bit 1 */

#define  SPI_GCTL_DMAEN                     ((uint16_t)0x0200)  		   /*!<  DMA access mode enable */  
#define  SPI_GCTL_NSS_SEL                   ((uint16_t)0x0400)  		   /*!<  NSS select signal that from software or hardware*/
#define  SPI_GCTL_DATA_SEL                  ((uint16_t)0x0800)  		   /*!<  Valid byte or double-word data select signal*/

/*******************  Bit definition for SPI_CCTL register  ********************/  
#define  SPI_CCTL_CPHA                      ((uint16_t)0x0001)  		   /*!<  Clock phase select bit*/  	
#define  SPI_CCTL_CPOL                      ((uint16_t)0x0002)  		   /*!<  Clock polarity select bit*/  
#define  SPI_CCTL_LSBFE                     ((uint16_t)0x0004)  		   /*!<  LSI first enable bit*/  
#define  SPI_CCTL_SPILEN                    ((uint16_t)0x0008)   		   /*!<  SPI character length bit*/  
#define  SPI_CCTL_RXEDGE                    ((uint16_t)0x0010)   		   /*!<  Receive data edge select*/  
#define  SPI_CCTL_TXEDGE                    ((uint16_t)0x0020)   		   /*!<  Transmit data edge select*/  

/*******************  Bit definition for SPI_SPBRG register  ********************/ 
#define  SPI_SPBRG_SPBRG                    ((uint16_t)0x0000FFFF)    	   /*!<  SPI baud rate control register for baud rate*/  

/*******************  Bit definition for SPI_RXDNR register  ********************/ 
#define  SPI_RXDNR_RXDNR                    ((uint32_t)0xFFFFFFFF)  	   /*!<  The register is used to hold a count of to be received bytes in next receive process*/    

/*******************  Bit definition for SPI_NSSR register  ********************/ 
#define  SPI_NSSR_NSS                       ((uint8_t)0x01)    		       /*!<  Chip select output signal in Master mode*/  

/*******************  Bit definition for SPI_EXTCTL register  ********************/ 
#define  SPI_EXTCTL_EXTLEN                   ((uint8_t)0x1F)                /*!<  control SPI data length*/  
#define  SPI_EXTCTL_EXTLEN_0                 ((uint8_t)0x01)                 /*!<   Bit 0 */
#define  SPI_EXTCTL_EXTLEN_1                 ((uint8_t)0x02)                 /*!<   Bit 1 */
#define  SPI_EXTCTL_EXTLEN_2                 ((uint8_t)0x04)                 /*!<   Bit 2 */
#define  SPI_EXTCTL_EXTLEN_3                 ((uint8_t)0x08)                 /*!<   Bit 3 */
#define  SPI_EXTCTL_EXTLEN_4                 ((uint8_t)0x10)                 /*!<   Bit 4 */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CON register  ********************/
#define  I2C_CON_MASTER_MODE                             ((uint16_t)0x0001) 

#define  I2C_CON_SPEED                                   ((uint16_t)0x0006)         
#define  I2C_CON_SPEED_0                                 ((uint16_t)0x0002) 
#define  I2C_CON_SPEED_1                                 ((uint16_t)0x0004)  
        
#define  I2C_CON_10BITADDR_SLAVE                         ((uint16_t)0x0008)  
#define  I2C_CON_10BITADDR_MASTER                        ((uint16_t)0x0010)  
#define  I2C_CON_RESTART_EN                              ((uint16_t)0x0020) 
#define  I2C_CON_SLAVE_DISABLE                           ((uint16_t)0x0040) 
#define  I2C_CON_STOP_DET_IFADDRESSED                    ((uint16_t)0x0080) 
#define  I2C_CON_EMPTY_CTRL                              ((uint16_t)0x0100) 

/*******************  Bit definition for I2C_TAR register  ********************/
#define  I2C_TAR_TAR                                     ((uint16_t)0x03FF) 
#define  I2C_TAR_TAR_0                                   ((uint16_t)0x0001) 
#define  I2C_TAR_TAR_1                                   ((uint16_t)0x0002) 
#define  I2C_TAR_TAR_2                                   ((uint16_t)0x0004) 
#define  I2C_TAR_TAR_3                                   ((uint16_t)0x0008) 
#define  I2C_TAR_TAR_4                                   ((uint16_t)0x0010) 
#define  I2C_TAR_TAR_5                                   ((uint16_t)0x0020) 
#define  I2C_TAR_TAR_6                                   ((uint16_t)0x0040) 
#define  I2C_TAR_TAR_7                                   ((uint16_t)0x0080) 
#define  I2C_TAR_TAR_8                                   ((uint16_t)0x0100) 
#define  I2C_TAR_TAR_9                                   ((uint16_t)0x0200) 

#define  I2C_TAR_GC_OR_START                             ((uint16_t)0x0400) 
#define  I2C_TAR_SPECIAL                                 ((uint16_t)0x0800) 

/*******************  Bit definition for I2C_SAR register  ********************/
#define  I2C_SAR_SAR                                     ((uint16_t)0x03FF)
#define  I2C_SAR_SAR_0                                   ((uint16_t)0x0001) 
#define  I2C_SAR_SAR_1                                   ((uint16_t)0x0002) 
#define  I2C_SAR_SAR_2                                   ((uint16_t)0x0004) 
#define  I2C_SAR_SAR_3                                   ((uint16_t)0x0008) 
#define  I2C_SAR_SAR_4                                   ((uint16_t)0x0010) 
#define  I2C_SAR_SAR_5                                   ((uint16_t)0x0020) 
#define  I2C_SAR_SAR_6                                   ((uint16_t)0x0040) 
#define  I2C_SAR_SAR_7                                   ((uint16_t)0x0080) 
#define  I2C_SAR_SAR_8                                   ((uint16_t)0x0100) 
#define  I2C_SAR_SAR_9                                   ((uint16_t)0x0200) 

